flix/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = 6  [["description", "An epic battle between The Caped Crusader and the fire-breathing dinosaur Gojira. Hang on to your popcorn, kids! "], ["updated_at", "2015-12-19 15:53:42.636811"]]
---
  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 7]]
---
  def destroy
    @movie = Movie.find(params[:id])
    redirect_to movies_url,
                alert: 'Movie successfully deleted!' if @movie.destroy